Revit 2024 API
Transform2D.OfVector Method
 Applies the transformation to the vector and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public UV OfVector(
	UV vector
)
Visual Basic
Public Function OfVector ( _
	vector As UV _
) As UV
Visual C++
public:
UV^ OfVector(
	UV^ vector
)
Parameters
vector
Type: Autodesk.Revit.DB.UV
 The vector to transform.
Return Value
 The transformed vector.
Remarks
 Transformation of a vector is not affected by the translational part of the transformation.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Transform2D Class
Autodesk.Revit.DB Namespace